<?php


    /**
     * 入力チェッククラス（基本的にstatic）
     * 全メソッドにおいて、エラー時はTrueが戻る
     *
     * Created by PhpStorm.
     * User: kazuki kubota@castler
     * Date: 2016/07/22
     * Time: 3:21
     *
     * Ver 4.0  2016/07/22  ローマ字チェック　を追加
     */
    class Validate {

        /*******************************************************************
         * 処理 : 文字数チェック
         * 引数 : $data = 検証対象
         * $len = 入力可能文字数
         * 戻り値 : boolean
         *******************************************************************/
        public static function lengthCheck($data, $len) {
            return (strlen($data) > $len);
        }


        /*******************************************************************
         * 処理 : 数字チェック
         * 引数 : $data = 検証対象
         * 戻り値 : boolean
         *******************************************************************/
        public static function isNumeric($data) {
            return (!is_numeric($data));
        }


        /*******************************************************************
         * 処理 : 数字と半角ハイフンチェック
         * 引数 : $data = 検証対象
         * 戻り値 : boolean
         *******************************************************************/
        public static function isNumericHyphen($data) {
            return !(preg_match("/^[0-9-]+$/u", $data));
        }


        /*******************************************************************
         * 処理 : メールアドレスチェック
         * 引数 : $data = 検証対象
         * 戻り値 : boolean
         *******************************************************************/
        public static function isMailaddress($data) {
            return (!preg_match("/^[^@]+@([-a-z0-9]+\.)+[a-z]{2,}$/", $data));
        }


        /*******************************************************************
         * 処理 : 日付チェック
         * 引数 : $year = 年
         * $month = 月
         * $day = 日
         * 戻り値 : boolean
         *******************************************************************/
        public static function isDate($year, $month, $day) {
            if ($year == "" || $month == "" || $day == "" || Validate::isNumeric($year) || Validate::isNumeric($month) || Validate::isNumeric($day)) return TRUE;

            $ret = (!checkdate($month, $day, $year));

            return $ret;
        }


        /*******************************************************************
         * 処理 : 入力必須チェック
         * 引数 : $data = 検証対象
         * 戻り値 : boolean
         *******************************************************************/
        public static function isEmpty($data) {
            return (!strlen(trim($data)));
        }


        /*******************************************************************
         * 処理 : 同一チェック（$data1と$data2が正しいか）
         * 引数 : $data1 = 検証対象1
         * $data2 = 検証対象2
         * 戻り値 : boolean
         *******************************************************************/
        public static function isPerfectEqual($data1, $data2) {
            return !($data1 === $data2);
        }


        /*******************************************************************
         * 処理 : カタカナチェック
         * 引数 : $data = 検証対象
         * 戻り値 : boolean
         *******************************************************************/
        public static function isKana($data) {
            return !(preg_match("/^[ァ-ヾ]+$/u", $data));
        }


        /*******************************************************************
         * 処理 : ひらがなチェック
         * 引数 : $data = 検証対象
         * 戻り値 : boolean
         *******************************************************************/
        public static function isHiragana($data) {
            return !(preg_match("/^[あ-ん]+$/u", $data));
        }


        /*******************************************************************
         * 処理 : ローマ字チェック
         * 引数 : $data = 検証対象
         * 戻り値 : boolean
         *******************************************************************/
        public static function isAlphabet($data) {
            return !(preg_match("/^[A-z]+$/u", $data));
        }

    }